tap "bufbuild/buf"
tap "dart-lang/dart"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "act"
brew "aqua"
brew "arp-scan"
brew "bastet"
brew "openssl@3"
brew "bat"
brew "mecab"
brew "mecab-ipadic"
brew "cabocha"
brew "cloc"
brew "cocoapods"
brew "ripgrep"
brew "codex"
brew "cowsay"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "envoy"
brew "node", link: false
brew "eslint"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-flow"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "golangci-lint"
brew "gradle"
brew "graphviz"
brew "grpcui"
brew "gtop"
brew "icu4c@76"
brew "jq"
brew "kotlin"
brew "lazygit"
brew "libfido2"
brew "lua-language-server"
brew "minicom"
brew "mtr"
brew "mysql"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "openapi-generator"
brew "pgloader"
brew "pinentry-mac"
brew "pkgconf"
brew "poppler"
brew "postgresql@18"
brew "pre-commit"
brew "prettier"
brew "prettierd"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "rye"
brew "sshpass"
brew "tailwindcss-language-server"
brew "telnet"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "vim"
brew "wget"
brew "bufbuild/buf/buf"
brew "dart-lang/dart/dart"
brew "hashicorp/tap/packer"
brew "heroku/brew/heroku"
brew "teamookla/speedtest/speedtest"
cask "1password-cli"
cask "font-hack-nerd-font"
cask "keycastr"
cask "pgadmin4"
cask "pycharm"
cask "warp"
cask "wireshark-app"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "afmicc.getterandsettergenerator"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "clemenspeters.format-json"
vscode "cordx56.rustowl-vscode"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "meta.pyrefly"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naco-siren.gradle-language"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "seelog.python-init-generator"
vscode "shardulm94.trailing-spaces"
vscode "steoates.autoimport"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tialki.tex-preview"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "wraith13.bracket-lens"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/dl/go1.23.4"
go "github.com/jfeliu007/goplantuml/cmd/goplantuml"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/fullstorydev/grpcui/cmd/grpcui"
go "github.com/improbable-eng/grpc-web/go/grpcwebproxy"
go "github.com/golang/protobuf/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/infobloxopen/protoc-gen-gorm"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "honnef.co/go/tools/cmd/staticcheck"
